package lessons.lesson05.homeworks

fun main() {
/*
    Задача 1
    Контекст: Вы изучаете физическое явление затухания звука в помещении.
    У вас есть измеренное значение начальной интенсивности звука,
    но из-за ограничений оборудования данные о коэффициенте затухания иногда могут быть неизвестны.
    Задача: Рассчитать предполагаемую интенсивность звука после затухания.
    Интенсивность звука после затухания пропорциональна начальной интенсивности, умноженной на коэффициент затухания.
    Если коэффициент затухания неизвестен, использовать стандартное значение 0.5.
*/

    var loudSound:Double = 1.1
    var attenuationCoefficient: Double? = null //изменить значение на нужное
    var soundIntensityAfterDecay: Double = loudSound * (attenuationCoefficient?: 0.5)
    println("Интенсивность звука после затухания: $soundIntensityAfterDecay")

/*
    Задача 2
    Контекст: Клиент оплачивает доставку груза. К стоимости доставки добавляется страховка на груз,
    которая составляет 0,5% от его стоимости. В случае, если стоимость не указана, то берётся стандартная стоимость в $50
    Задача: Рассчитать полную стоимость доставки.
*/

    var valueCargo: Double? = null //стоимость груза, изменить значение на нужное
    var shippingCoast: Double = 5.0 //стоимость доставки
    var insurance: Double = 0.005 // 0.5 / 100
    var totalShippingCoast = shippingCoast + ((valueCargo?: 50.0) * insurance)
    println("Полная стоимость доставки: $totalShippingCoast")

 /*
    Задача 3
    Контекст: Вы проводите метеорологические измерения.
    Одним из важных показателей является атмосферное давление, которое должно быть зафиксировано.
    Лаборант приносит вам набор показателей, но по пути может что-нибудь потерять.
    Задача - сообщить об ошибке в случае отсутствия показаний атмосферного давления.
*/

    var pressure: Double? = null //изменить значение на нужное
    var infoAboutPressure = (pressure?: "Информация о давлении отсутствует")
    println("Давление: $infoAboutPressure")
}
